cmsis-svd/cmsis-svd/data/Spansion/MB9BF46xx_svd.xml
        <!-- REGISTER "IRQ020MON" -->
        <register>
          <name>IRQ020MON</name>
          <description> register IRQ020MON </description>
          <addressOffset>0x254</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "QUDINT5" -->
            <field>
              <name>QUDINT5</name>
              <description> bitfield QUDINT5 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QUDINT4" -->
            <field>
              <name>QUDINT4</name>
              <description> bitfield QUDINT4 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QUDINT3" -->
            <field>
              <name>QUDINT3</name>
              <description> bitfield QUDINT3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QUDINT2" -->
            <field>
              <name>QUDINT2</name>
              <description> bitfield QUDINT2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QUDINT1" -->
            <field>
              <name>QUDINT1</name>
              <description> bitfield QUDINT1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QUDINT0" -->
            <field>
              <name>QUDINT0</name>
              <description> bitfield QUDINT0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ021MON" -->
        <register>
          <name>IRQ021MON</name>
          <description> register IRQ021MON </description>
          <addressOffset>0x258</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WAVEINT3" -->
            <field>
              <name>WAVEINT3</name>
              <description> bitfield WAVEINT3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WAVEINT2" -->
            <field>
              <name>WAVEINT2</name>
              <description> bitfield WAVEINT2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WAVEINT1" -->
            <field>
              <name>WAVEINT1</name>
              <description> bitfield WAVEINT1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WAVEINT0" -->
            <field>
              <name>WAVEINT0</name>
              <description> bitfield WAVEINT0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ022MON" -->
        <register>
          <name>IRQ022MON</name>
          <description> register IRQ022MON </description>
          <addressOffset>0x25C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WAVEINT3" -->
            <field>
              <name>WAVEINT3</name>
              <description> bitfield WAVEINT3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WAVEINT2" -->
            <field>
              <name>WAVEINT2</name>
              <description> bitfield WAVEINT2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WAVEINT1" -->
            <field>
              <name>WAVEINT1</name>
              <description> bitfield WAVEINT1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WAVEINT0" -->
            <field>
              <name>WAVEINT0</name>
              <description> bitfield WAVEINT0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ023MON" -->
        <register>
          <name>IRQ023MON</name>
          <description> register IRQ023MON </description>
          <addressOffset>0x260</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WAVEINT3" -->
            <field>
              <name>WAVEINT3</name>
              <description> bitfield WAVEINT3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WAVEINT2" -->
            <field>
              <name>WAVEINT2</name>
              <description> bitfield WAVEINT2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WAVEINT1" -->
            <field>
              <name>WAVEINT1</name>
              <description> bitfield WAVEINT1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WAVEINT0" -->
            <field>
              <name>WAVEINT0</name>
              <description> bitfield WAVEINT0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
