cmsis-svd/cmsis-svd/data/Spansion/MB9BF46xx_svd.xml
        <!-- REGISTER "IRQ024MON" -->
        <register>
          <name>IRQ024MON</name>
          <description> register IRQ024MON </description>
          <addressOffset>0x264</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x07</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FRT_PEAK_INT2" -->
            <field>
              <name>FRT_PEAK_INT2</name>
              <description> bitfield FRT_PEAK_INT2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "FRT_PEAK_INT1" -->
            <field>
              <name>FRT_PEAK_INT1</name>
              <description> bitfield FRT_PEAK_INT1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "FRT_PEAK_INT0" -->
            <field>
              <name>FRT_PEAK_INT0</name>
              <description> bitfield FRT_PEAK_INT0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ025MON" -->
        <register>
          <name>IRQ025MON</name>
          <description> register IRQ025MON </description>
          <addressOffset>0x268</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x07</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FRT_ZERO_INT2" -->
            <field>
              <name>FRT_ZERO_INT2</name>
              <description> bitfield FRT_ZERO_INT2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "FRT_ZERO_INT1" -->
            <field>
              <name>FRT_ZERO_INT1</name>
              <description> bitfield FRT_ZERO_INT1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "FRT_ZERO_INT0" -->
            <field>
              <name>FRT_ZERO_INT0</name>
              <description> bitfield FRT_ZERO_INT0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ026MON" -->
        <register>
          <name>IRQ026MON</name>
          <description> register IRQ026MON </description>
          <addressOffset>0x26C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ICUINT3" -->
            <field>
              <name>ICUINT3</name>
              <description> bitfield ICUINT3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ICUINT2" -->
            <field>
              <name>ICUINT2</name>
              <description> bitfield ICUINT2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ICUINT1" -->
            <field>
              <name>ICUINT1</name>
              <description> bitfield ICUINT1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ICUINT0" -->
            <field>
              <name>ICUINT0</name>
              <description> bitfield ICUINT0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ027MON" -->
        <register>
          <name>IRQ027MON</name>
          <description> register IRQ027MON </description>
          <addressOffset>0x270</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "OCUINT5" -->
            <field>
              <name>OCUINT5</name>
              <description> bitfield OCUINT5 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "OCUINT4" -->
            <field>
              <name>OCUINT4</name>
              <description> bitfield OCUINT4 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "OCUINT3" -->
            <field>
              <name>OCUINT3</name>
              <description> bitfield OCUINT3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "OCUINT2" -->
            <field>
              <name>OCUINT2</name>
              <description> bitfield OCUINT2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "OCUINT1" -->
            <field>
              <name>OCUINT1</name>
              <description> bitfield OCUINT1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "OCUINT0" -->
            <field>
              <name>OCUINT0</name>
              <description> bitfield OCUINT0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
