cmsis-svd/cmsis-svd/data/Spansion/MB9BF46xx_svd.xml
        <!-- REGISTER "IRQ095MON" -->
        <register>
          <name>IRQ095MON</name>
          <description> register IRQ095MON </description>
          <addressOffset>0x380</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EXTINT3" -->
            <field>
              <name>EXTINT3</name>
              <description> bitfield EXTINT3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT2" -->
            <field>
              <name>EXTINT2</name>
              <description> bitfield EXTINT2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT1" -->
            <field>
              <name>EXTINT1</name>
              <description> bitfield EXTINT1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT0" -->
            <field>
              <name>EXTINT0</name>
              <description> bitfield EXTINT0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ096MON" -->
        <register>
          <name>IRQ096MON</name>
          <description> register IRQ096MON </description>
          <addressOffset>0x384</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "QUDINT5" -->
            <field>
              <name>QUDINT5</name>
              <description> bitfield QUDINT5 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QUDINT4" -->
            <field>
              <name>QUDINT4</name>
              <description> bitfield QUDINT4 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QUDINT3" -->
            <field>
              <name>QUDINT3</name>
              <description> bitfield QUDINT3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QUDINT2" -->
            <field>
              <name>QUDINT2</name>
              <description> bitfield QUDINT2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QUDINT1" -->
            <field>
              <name>QUDINT1</name>
              <description> bitfield QUDINT1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QUDINT0" -->
            <field>
              <name>QUDINT0</name>
              <description> bitfield QUDINT0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ097MON" -->
        <register>
          <name>IRQ097MON</name>
          <description> register IRQ097MON </description>
          <addressOffset>0x388</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "QUDINT5" -->
            <field>
              <name>QUDINT5</name>
              <description> bitfield QUDINT5 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QUDINT4" -->
            <field>
              <name>QUDINT4</name>
              <description> bitfield QUDINT4 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QUDINT3" -->
            <field>
              <name>QUDINT3</name>
              <description> bitfield QUDINT3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QUDINT2" -->
            <field>
              <name>QUDINT2</name>
              <description> bitfield QUDINT2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QUDINT1" -->
            <field>
              <name>QUDINT1</name>
              <description> bitfield QUDINT1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QUDINT0" -->
            <field>
              <name>QUDINT0</name>
              <description> bitfield QUDINT0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ098MON" -->
        <register>
          <name>IRQ098MON</name>
          <description> register IRQ098MON </description>
          <addressOffset>0x38C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BTINT1" -->
            <field>
              <name>BTINT1</name>
              <description> bitfield BTINT1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT0" -->
            <field>
              <name>BTINT0</name>
              <description> bitfield BTINT0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
