cmsis-svd/cmsis-svd/data/Spansion/MB9BF46xx_svd.xml
        <!-- REGISTER "BREG27" -->
        <register>
          <name>BREG27</name>
          <description> register BREG27 </description>
          <addressOffset>0x227</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG28" -->
        <register>
          <name>BREG28</name>
          <description> register BREG28 </description>
          <addressOffset>0x228</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG29" -->
        <register>
          <name>BREG29</name>
          <description> register BREG29 </description>
          <addressOffset>0x229</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG2A" -->
        <register>
          <name>BREG2A</name>
          <description> register BREG2A </description>
          <addressOffset>0x22A</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG2B" -->
        <register>
          <name>BREG2B</name>
          <description> register BREG2B </description>
          <addressOffset>0x22B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG2C" -->
        <register>
          <name>BREG2C</name>
          <description> register BREG2C </description>
          <addressOffset>0x22C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG2D" -->
        <register>
          <name>BREG2D</name>
          <description> register BREG2D </description>
          <addressOffset>0x22D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG2E" -->
        <register>
          <name>BREG2E</name>
          <description> register BREG2E </description>
          <addressOffset>0x22E</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG2F" -->
        <register>
          <name>BREG2F</name>
          <description> register BREG2F </description>
          <addressOffset>0x22F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG30" -->
        <register>
          <name>BREG30</name>
          <description> register BREG30 </description>
          <addressOffset>0x230</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG31" -->
        <register>
          <name>BREG31</name>
          <description> register BREG31 </description>
          <addressOffset>0x231</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG32" -->
        <register>
          <name>BREG32</name>
          <description> register BREG32 </description>
          <addressOffset>0x232</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG33" -->
        <register>
          <name>BREG33</name>
          <description> register BREG33 </description>
          <addressOffset>0x233</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG34" -->
        <register>
          <name>BREG34</name>
          <description> register BREG34 </description>
          <addressOffset>0x234</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG35" -->
        <register>
          <name>BREG35</name>
          <description> register BREG35 </description>
          <addressOffset>0x235</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG36" -->
        <register>
          <name>BREG36</name>
          <description> register BREG36 </description>
          <addressOffset>0x236</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG37" -->
        <register>
          <name>BREG37</name>
          <description> register BREG37 </description>
          <addressOffset>0x237</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG38" -->
        <register>
          <name>BREG38</name>
          <description> register BREG38 </description>
          <addressOffset>0x238</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
